In [1]:
import pandas as pd
from datetime import timedelta

In [2]:
df = pd.read_csv('dataset.csv')
df

,order_id,order_id3,customer_id3,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date,order_item_id,...,seller_city,seller_state,product_category_name_english,review_response_time,order_purchase_year,order_purchase_month,order_purchase_dayofweek,order_purchase_hour,order_purchase_day,order_purchase_mon
0,ON34305,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00,1.0,...,Maua,SP,housewares,1.0,2017,10,0,10,Mon,Oct
1,ON34305,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00,1.0,...,Maua,SP,housewares,1.0,2017,10,0,10,Mon,Oct
2,ON34305,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18 00:00:00,1.0,...,Maua,SP,housewares,1.0,2017,10,0,10,Mon,Oct
3,ON40291,128e10d95713541c87cd1a2e48201934,a20e8105f23924cd00833fd87daa0831,delivered,2017-08-15 18:29:31,2017-08-15 20:05:16,2017-08-17 15:28:33,2017-08-18 14:44:43,2017-08-28 00:00:00,1.0,...,Maua,SP,housewares,1.0,2017,8,1,18,Tue,Aug
4,ON74313,0e7e841ddf8f8f2de2bad69267ecfbcf,26c7ac168e1433912a51b924fbd34d34,delivered,2017-08-02 18:24:47,2017-08-02 18:43:15,2017-08-04 17:35:43,2017-08-07 18:30:01,2017-08-15 00:00:00,1.0,...,Maua,SP,housewares,0.0,2017,8,2,18,Wed,Aug
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
116576,ON07986,442a41b00a8a8bda35511fdf1eb65cc5,e42e2e8642f9c09100b6667e321c2811,invoiced,2018-07-11 22:27:32,2018-07-11 22:45:43,2018-07-13 19:02:36,2018-07-20 20:33:29,2018-07-20 00:00:00,1.0,...,Sao Paulo,SP,books imported,2.0,2018,7,2,22,Wed,Jul
116577,ON72724,1dbff949801376b8795a093d31cfe205,0cbd2df3d6e9d8b1eaf5cfefc44886bc,delivered,2018-05-16 14:50:54,2018-05-16 15:18:42,2018-05-18 12:10:00,2018-05-21 17:14:08,2018-05-28 00:00:00,1.0,...,Sao Paulo,SP,books imported,0.0,2018,5,2,14,Wed,May
116578,ON15901,6775b950cdc4da0ce39b261032f92c84,c4d135422be0d4333f506acde8af9419,delivered,2018-06-13 12:19:26,2018-06-13 17:39:14,2018-06-15 13:09:00,2018-06-16 17:48:30,2018-06-28 00:00:00,1.0,...,Sao Paulo,SP,books imported,0.0,2018,6,2,12,Wed,Jun
116579,ON44476,73d60420cd1a179b2d8887d538efe4c2,65d9213dfa004c17dc126503e106e4a3,delivered,2018-08-07 10:52:58,2018-08-07 11:05:18,2018-08-08 08:31:00,2018-08-22 17:02:23,2018-09-04 00:00:00,1.0,...,Rio De Janeiro,RJ,books imported,2.0,2018,8,1,10,Tue,Aug
116580,ON08855,f5cf5716413185387030a378bdd46ebe,ff95df9a387c8d032a2ca6887cf77236,processing,2017-02-19 22:31:47,2017-02-19 22:45:13,2017-02-21 19:02:06,2017-02-28 20:32:59,2017-03-21 00:00:00,1.0,...,Sao Paulo,SP,books imported,0.0,2017,2,6,22,Sun,Feb

In [3]:
df.shape

(116581, 53)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 116581 entries, 0 to 116580
Data columns (total 53 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   order_id                       116581 non-null  object
 1   order_id3                      116581 non-null  object
 2   customer_id3                   116581 non-null  object
 3   order_status                   116581 non-null  object
 4   order_purchase_timestamp       116581 non-null  object
 5   order_approved_at              116581 non-null  object
 6   order_delivered_carrier_date   116581 non-null  object
 7   order_delivered_customer_date  116581 non-null  object
 8   order_estimated_delivery_date  116581 non-null  object
 9   order_item_id                  116581 non-null  float64
 10  product_id3                    116581 non-null  object
 11  seller_id3                     116581 non-null  object
 12  shipping_limit_date            116581 non-null  object
 13  price                          116581 non-null  float64
 14  freight_value                  116581 non-null  float64
 15  payment_sequential             116581 non-null  int64
 16  payment_type                   116581 non-null  object
 17  payment_installments           116581 non-null  int64
 18  payment_value                  116581 non-null  float64
 19  review_id                      116581 non-null  object
 20  review_id3                     116581 non-null  object
 21  review_score                   116581 non-null  float64
 22  review_comment_title           13996 non-null   object
 23  review_comment_message         49878 non-null   object
 24  review_creation_date           116578 non-null  object
 25  review_answer_timestamp        116578 non-null  object
 26  product_id                     116581 non-null  object
 27  product_category_name          116581 non-null  object
 28  product_name_lenght            116581 non-null  float64
 29  product_description_lenght     116581 non-null  float64
 30  product_photos_qty             116581 non-null  float64
 31  product_weight_g               116580 non-null  float64
 32  product_length_cm              116580 non-null  float64
 33  product_height_cm              116580 non-null  float64
 34  product_width_cm               116580 non-null  float64
 35  customer_id                    116581 non-null  int64
 36  customer_unique_id             116581 non-null  object
 37  customer_uniqueid3             116581 non-null  object
 38  customer_zip_code_prefix       116581 non-null  int64
 39  customer_city                  116581 non-null  object
 40  customer_state                 116581 non-null  object
 41  seller_id                      116581 non-null  object
 42  seller_zip_code_prefix         116581 non-null  int64
 43  seller_city                    116581 non-null  object
 44  seller_state                   116581 non-null  object
 45  product_category_name_english  116581 non-null  object
 46  review_response_time           116578 non-null  float64
 47  order_purchase_year            116581 non-null  int64
 48  order_purchase_month           116581 non-null  int64
 49  order_purchase_dayofweek       116581 non-null  int64
 50  order_purchase_hour            116581 non-null  int64
 51  order_purchase_day             116581 non-null  object
 52  order_purchase_mon             116581 non-null  object
dtypes: float64(13), int64(9), object(31)
memory usage: 47.1+ MB

In [5]:
df_analise = df[['order_purchase_timestamp', 'customer_unique_id', 
                 'payment_value','order_id']]

In [6]:
df_analise

       order_purchase_timestamp customer_unique_id  payment_value order_id
0           2017-10-02 10:56:33             C10952          18.12  ON34305
1           2017-10-02 10:56:33             C10952           2.00  ON34305
2           2017-10-02 10:56:33             C10952          18.59  ON34305
3           2017-08-15 18:29:31             C90486          37.77  ON40291
4           2017-08-02 18:24:47             C18951          37.77  ON74313
...                         ...                ...            ...      ...
116576      2018-07-11 22:27:32             C53792          52.57  ON07986
116577      2018-05-16 14:50:54             C90004          66.38  ON72724
116578      2018-06-13 12:19:26             C09253          31.42  ON15901
116579      2018-08-07 10:52:58             C35727         804.96  ON44476
116580      2017-02-19 22:31:47             C47242         114.90  ON08855

[116581 rows x 4 columns]

In [ ]:
df_analise.info()

In [ ]:
df_analise['order_purchase_timestamp'] = pd.to_datetime(
    df_analise['order_purchase_timestamp'])

In [ ]:
df_analise['data_venda'] = df_analise['order_purchase_timestamp'].dt.date

In [ ]:
df_analise.rename(columns={'order_purchase_timestamp': 'data_hora_venda', 
                           'customer_unique_id': 'cliente_id', 
                           'payment_value': 'valor_venda','order_id': 'id_pedido'}, 
                           inplace=True)

In [ ]:
df_analise

In [13]:
data_mais_atual = df_analise['data_venda'].max() + timedelta(days=1)
data_mais_atual

datetime.date(2018, 9, 4)

In [14]:
df_agregado = df_analise.groupby('cliente_id').agg({'data_venda': lambda x: (data_mais_atual - x.max()).days,
                                                   'id_pedido': 'count',
                                                   'valor_venda': 'sum'})

In [15]:
df_agregado

            data_venda  id_pedido  valor_venda
cliente_id
C00001              73          1       121.82
C00002              66          1       155.76
C00003             337          1       181.55
C00004             193          1        90.78
C00005             283          1       266.89
...                ...        ...          ...
C96994             112          1        32.00
C96995              39          2       223.84
C96996              33          1       288.88
C96997              40          5       960.75
C96999             232          1        39.00

[94087 rows x 3 columns]

In [16]:
df_agregado.shape

(94087, 3)

In [17]:
df['customer_unique_id'].nunique()

94087

In [18]:
df_agregado.info()

<class 'pandas.core.frame.DataFrame'>
Index: 94087 entries, C00001 to C96999
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   data_venda   94087 non-null  int64
 1   id_pedido    94087 non-null  int64
 2   valor_venda  94087 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 2.9+ MB

In [19]:
df_agregado.rename(columns={'data_venda': 'recencia', 
                            'id_pedido': 'frequencia', 
                            'valor_venda': 'monetario'}, inplace=True)

In [20]:
df_agregado

            recencia  frequencia  monetario
cliente_id
C00001            73           1     121.82
C00002            66           1     155.76
C00003           337           1     181.55
C00004           193           1      90.78
C00005           283           1     266.89
...              ...         ...        ...
C96994           112           1      32.00
C96995            39           2     223.84
C96996            33           1     288.88
C96997            40           5     960.75
C96999           232           1      39.00

[94087 rows x 3 columns]

In [21]:
r_groups = pd.qcut(df_agregado['recencia'], q=5, labels=range(1,6))
r_groups

cliente_id
C00001    1
C00002    1
C00003    4
C00004    3
C00005    4
         ..
C96994    2
C96995    1
C96996    1
C96997    1
C96999    3
Name: recencia, Length: 94087, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [22]:
r_groups.value_counts()

recencia
3    18940
2    18837
1    18830
4    18745
5    18735
Name: count, dtype: int64

In [23]:
df_agregado['R'] = r_groups
df_agregado

            recencia  frequencia  monetario  R
cliente_id
C00001            73           1     121.82  1
C00002            66           1     155.76  1
C00003           337           1     181.55  4
C00004           193           1      90.78  3
C00005           283           1     266.89  4
...              ...         ...        ... ..
C96994           112           1      32.00  2
C96995            39           2     223.84  1
C96996            33           1     288.88  1
C96997            40           5     960.75  1
C96999           232           1      39.00  3

[94087 rows x 4 columns]

In [24]:
f_groups = pd.cut(df_agregado['frequencia'], 
                  bins=[0,1,2,4,8, float('inf')], labels=range(1,6))
f_groups

cliente_id
C00001    1
C00002    1
C00003    1
C00004    1
C00005    1
         ..
C96994    1
C96995    2
C96996    1
C96997    4
C96999    1
Name: frequencia, Length: 94087, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [25]:
df_agregado['F'] = f_groups
df_agregado

            recencia  frequencia  monetario  R  F
cliente_id
C00001            73           1     121.82  1  1
C00002            66           1     155.76  1  1
C00003           337           1     181.55  4  1
C00004           193           1      90.78  3  1
C00005           283           1     266.89  4  1
...              ...         ...        ... .. ..
C96994           112           1      32.00  2  1
C96995            39           2     223.84  1  2
C96996            33           1     288.88  1  1
C96997            40           5     960.75  1  4
C96999           232           1      39.00  3  1

[94087 rows x 5 columns]

In [26]:
df_agregado['monetario'].describe()

count     94087.000000
mean        214.249054
std         647.368039
min           9.590000
25%          64.000000
50%         113.150000
75%         203.770000
max      109312.640000
Name: monetario, dtype: float64

In [27]:
m_groups = pd.qcut(df_agregado['monetario'], q=5, labels=range(1,6))
m_groups

cliente_id
C00001    3
C00002    4
C00003    4
C00004    3
C00005    5
         ..
C96994    1
C96995    4
C96996    5
C96997    5
C96999    1
Name: monetario, Length: 94087, dtype: category
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [28]:
df_agregado['M'] = m_groups
df_agregado

            recencia  frequencia  monetario  R  F  M
cliente_id
C00001            73           1     121.82  1  1  3
C00002            66           1     155.76  1  1  4
C00003           337           1     181.55  4  1  4
C00004           193           1      90.78  3  1  3
C00005           283           1     266.89  4  1  5
...              ...         ...        ... .. .. ..
C96994           112           1      32.00  2  1  1
C96995            39           2     223.84  1  2  4
C96996            33           1     288.88  1  1  5
C96997            40           5     960.75  1  4  5
C96999           232           1      39.00  3  1  1

[94087 rows x 6 columns]

In [29]:
df_agregado.info()

<class 'pandas.core.frame.DataFrame'>
Index: 94087 entries, C00001 to C96999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   recencia    94087 non-null  int64
 1   frequencia  94087 non-null  int64
 2   monetario   94087 non-null  float64
 3   R           94087 non-null  category
 4   F           94087 non-null  category
 5   M           94087 non-null  category
dtypes: category(3), float64(1), int64(2)
memory usage: 5.2+ MB

In [ ]:
df_agregado['R' ] = df_agregado['R'].astype(int)
df_agregado['F'] = df_agregado['F'].astype(int)
df_agregado['M'] = df_agregado['M'].astype(int)

In [31]:
df_agregado['RFM_Score'] = df_agregado['R'] + df_agregado['F'] + df_agregado['M']
df_agregado['RFM_Segment'] = df_agregado['R'].astype(str) + df_agregado['F'].astype(str) + df_agregado['M'].astype(str)

In [32]:
df_agregado[['R', 'F', 'M', 'RFM_Score', 'RFM_Segment']].head()

            R  F  M  RFM_Score RFM_Segment
cliente_id
C00001      1  1  3          5         113
C00002      1  1  4          6         114
C00003      4  1  4          9         414
C00004      3  1  3          7         313
C00005      4  1  5         10         415

In [33]:
def classify_by_score(score):
    if score >= 11:
        return 'Alto Valor'
    elif score >= 7:
        return 'Médio Valor'
    else:
        return 'Baixo Valor'

def classify_by_segment(segment):
    r, f, m = int(segment[0]), int(segment[1]), int(segment[2])
    if r >= 4 and f >= 4 and m >= 4:
        return 'Campeões'
    elif r >= 3 and f >= 3 and m >= 3:
        return 'Clientes Fiéis'
    elif r >= 3 and f >= 1 and m >= 3:
        return 'Clientes Potenciais'
    elif r >= 3 and f >= 1 and m >= 1:
        return 'Novos Clientes'
    elif r >= 1 and f >= 1 and m >= 1:
        return 'Clientes em Risco'
    else:
        return 'Perdidos'

In [34]:
df_agregado['Classe_Score'] = df_agregado['RFM_Score'].apply(classify_by_score)
df_agregado['Classe_Segmento'] = df_agregado['RFM_Segment'].apply(classify_by_segment)

In [35]:
df_agregado

,recencia,frequencia,monetario,R,F,M,RFM_Score,RFM_Segment,Classe_Score,Classe_Segmento
cliente_id,,,,,,,,,,
C00001,73,1,121.82,1,1,3,5,113,Baixo Valor,Clientes em Risco
C00002,66,1,155.76,1,1,4,6,114,Baixo Valor,Clientes em Risco
C00003,337,1,181.55,4,1,4,9,414,Médio Valor,Clientes Potenciais
C00004,193,1,90.78,3,1,3,7,313,Médio Valor,Clientes Potenciais
C00005,283,1,266.89,4,1,5,10,415,Médio Valor,Clientes Potenciais
...,...,...,...,...,...,...,...,...,...,...
C96994,112,1,32.00,2,1,1,4,211,Baixo Valor,Clientes em Risco
C96995,39,2,223.84,1,2,4,7,124,Médio Valor,Clientes em Risco
C96996,33,1,288.88,1,1,5,7,115,Médio Valor,Clientes em Risco
C96997,40,5,960.75,1,4,5,10,145,Médio Valor,Clientes em Risco
C96999,232,1,39.00,3,1,1,5,311,Baixo Valor,Novos Clientes

In [36]:
print("Distribuição por Classe Score:")
print(df_agregado['Classe_Score'].value_counts())
print("\nDistribuição por Classe Segmento:")
print(df_agregado['Classe_Segmento'].value_counts())

Distribuição por Classe Score:
Classe_Score
Médio Valor    50889
Baixo Valor    36268
Alto Valor      6930
Name: count, dtype: int64

Distribuição por Classe Segmento:
Classe_Segmento
Clientes em Risco      37667
Clientes Potenciais    31281
Novos Clientes         22989
Clientes Fiéis          1846
Campeões                 304
Name: count, dtype: int64

In [37]:
def acao_por_segmento(classe):
    if classe == 'Campeões':
        return 'Priorizar: Oferecer benefícios exclusivos e programas VIP para maximizar retenção e valor.'
    elif classe == 'Clientes Fiéis':
        return 'Manter: Enviar comunicações regulares e ofertas de upsell para fortalecer o relacionamento.'
    elif classe == 'Clientes Potenciais':
        return 'Converter: Incentivar compras mais frequentes com promoções personalizadas e cross-sell.'
    elif classe == 'Novos Clientes':
        return 'Integrar: Bem-vindo e orientações para construir lealdade desde o início.'
    elif classe == 'Clientes em Risco':
        return 'Reativar: Campanhas de win-back com descontos e lembretes para recuperar interesse.'
    else:
        return 'Avaliar: Considerar se vale a pena investir em reativação ou focar em segmentos mais promissores.'

In [38]:
df_agregado['Acao'] = df_agregado['Classe_Segmento'].apply(acao_por_segmento)

In [39]:
df_agregado[['Classe_Segmento', 'Acao']].sample(10)

,Classe_Segmento,Acao
cliente_id,,
C76422,Clientes em Risco,Reativar: Campanhas de win-back com descontos ...
C91655,Novos Clientes,Integrar: Bem-vindo e orientações para constru...
C74607,Clientes Potenciais,Converter: Incentivar compras mais frequentes ...
C57865,Clientes Potenciais,Converter: Incentivar compras mais frequentes ...
C28207,Clientes Potenciais,Converter: Incentivar compras mais frequentes ...
C24937,Clientes Potenciais,Converter: Incentivar compras mais frequentes ...
C82270,Clientes Potenciais,Converter: Incentivar compras mais frequentes ...
C32123,Clientes em Risco,Reativar: Campanhas de win-back com descontos ...
C59777,Clientes Fiéis,Manter: Enviar comunicações regulares e oferta...
C51642,Novos Clientes,Integrar: Bem-vindo e orientações para constru...

In [ ]:
df_agregado